zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA266/drivers/fsl_clock.c
    if (kNONE_to_NONE != connection)
    {
        CLOCK_SetClockSelect((clock_select_name_t)reg_offset, clk_sel);
    }
}

/* Return the actual clock attach id */
/**
 * brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * param   connection  : Clock attach id to get.
 * return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId(clock_attach_id_t connection)
{
    uint32_t actual_sel       = 0U;
    uint32_t clock_attach_id  = 0U;

    if (kNONE_to_NONE == connection)
    {
        return kNONE_to_NONE;
    }

    const uint32_t reg_offset = CLK_ATTACH_REG_OFFSET(connection);

    actual_sel      = CLOCK_GetClockSelect((clock_select_name_t)reg_offset);
    clock_attach_id = CLK_ATTACH_MUX(reg_offset, actual_sel);

    assert(clock_attach_id < 0xFFFFFFFFU);

    return (clock_attach_id_t)clock_attach_id;
}

/* Set the clock selection value */
status_t CLOCK_SetClockSelect(clock_select_name_t sel_name, uint32_t value)
{
    volatile uint32_t *pClkCtrl = (volatile uint32_t *)(MRCC0_BASE + (uint32_t)sel_name);
    assert(sel_name <= kCLOCK_SelMax);

    if (sel_name == kCLOCK_SelSCGSCS)
    {
        SCG0->RCCR = (SCG0->RCCR & ~(SCG_RCCR_SCS_MASK)) | SCG_RCCR_SCS(value);

#if (SOC_DRIVER_RETRY_TIMES != 0U)
        uint32_t waitTimes = SOC_DRIVER_RETRY_TIMES;
#endif
        while ((SCG0->CSR & SCG_CSR_SCS_MASK) != SCG_CSR_SCS(value))
        {
#if (SOC_DRIVER_RETRY_TIMES != 0U)
            if (--waitTimes == 0U)
            {
                assert(false);
                return kStatus_Timeout;
            }
#endif
        }
    }
    else
    {
        /* Unlock clock configuration */
        SYSCON->CLKUNLOCK &= ~SYSCON_CLKUNLOCK_UNLOCK_MASK;

        *pClkCtrl = value;

        /* Freeze clock configuration */
        SYSCON->CLKUNLOCK |= SYSCON_CLKUNLOCK_UNLOCK_MASK;
    }

    return kStatus_Success;
}

/* Get the clock selection value */
uint32_t CLOCK_GetClockSelect(clock_select_name_t sel_name)
{
    volatile uint32_t *pClkCtrl = (volatile uint32_t *)(MRCC0_BASE + (uint32_t)sel_name);
    uint32_t actual_sel         = 0U;
    assert(sel_name <= kCLOCK_SelMax);

    if (sel_name == kCLOCK_SelSCGSCS)
    {
        actual_sel = (uint32_t)((SCG0->RCCR & SCG_RCCR_SCS_MASK) >> SCG_RCCR_SCS_SHIFT);
    }
    else
    {
        actual_sel = *pClkCtrl;
    }

    return actual_sel;
}

/* Set the clock divider value */
void CLOCK_SetClockDiv(clock_div_name_t div_name, uint32_t value)
{
    volatile uint32_t *pDivCtrl = (volatile uint32_t *)(MRCC0_BASE + (uint32_t)div_name);
    assert(div_name <= kCLOCK_DivMax);

    /* Early exit: current DIV value already matches the requested value,
     * and the divider is not in halt state */
    if ((value != 0U) && ((*pDivCtrl & (1UL << 30U)) == 0U) && ((*pDivCtrl & 0xFFU) == (value - 1U)))
    {
        return;
    }

    /* Unlock clock configuration */
    SYSCON->CLKUNLOCK &= ~SYSCON_CLKUNLOCK_UNLOCK_MASK;

    /* AHBCLKDIV does not support HALT(bit30) or RESET(bit29);
     * writing those bits would corrupt reserved fields. Write the DIV value directly. */
    if (div_name == kCLOCK_DivAHBCLK)
    {
        *pDivCtrl = (value == 0U) ? 0U : (value - 1U);
    }
    else
    {
        /* halt and reset clock dividers */
        *pDivCtrl = 0x3UL << 29U;

        if (value == 0U) /*!<  halt */
        {
            *pDivCtrl |= (1UL << 30U);
        }
        else
        {
            /* Write new DIV value while keeping HALT bit set */
            *pDivCtrl = (value - 1U) | (1UL << 30U);
            /* Clear HALT bit to start the divider with the new value */
            *pDivCtrl &= ~(1UL << 30U);
        }
    }

    /* Freeze clock configuration */
    SYSCON->CLKUNLOCK |= SYSCON_CLKUNLOCK_UNLOCK_MASK;
}

/* Get the clock divider value */
uint32_t CLOCK_GetClockDiv(clock_div_name_t div_name)
{
    volatile uint32_t *pDivCtrl = (volatile uint32_t *)(MRCC0_BASE + (uint32_t)div_name);
    assert(div_name <= kCLOCK_DivMax);

    if (((*pDivCtrl) & (1UL << 30U)) != 0U)
    {
        return 0;
    }
    else
    {
        return ((*pDivCtrl & 0xFFU) + 1U);
    }
}

/* Halt the clock divider value */
void CLOCK_HaltClockDiv(clock_div_name_t div_name)
{
    volatile uint32_t *pDivCtrl = (volatile uint32_t *)(MRCC0_BASE + (uint32_t)div_name);
    assert(div_name <= kCLOCK_DivMax);

    /* Unlock clock configuration */
    SYSCON->CLKUNLOCK &= ~SYSCON_CLKUNLOCK_UNLOCK_MASK;

    *pDivCtrl |= (1UL << 30U);

    /* Freeze clock configuration */
    SYSCON->CLKUNLOCK |= SYSCON_CLKUNLOCK_UNLOCK_MASK;
}

/* Initialize the FROHF to given frequency (45,60,90,180)
 * (80,120,240) are only supported for 240M part */
status_t CLOCK_SetupFROHFClocking(uint32_t iFreq)
{
    uint8_t freq_select       = 0x0U;
    uint8_t need_switch_frohf = 0x0U;
    uint32_t trim_value       = 0x0U;
    switch (iFreq)
    {
        case 45000000U:
            freq_select = 1U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 60000000U:
            freq_select = 3U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 90000000U:
            freq_select = 5U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
        case 180000000U:
            freq_select = 7U;
            trim_value  = IFR1_VAL_180M_TRIM;
            break;
#if FSL_FEATURE_FIRC_SUPPORT_240M
        case 80000000U:
            freq_select = 3U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
        case 120000000U:
            freq_select = 5U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
        case 240000000U:
            freq_select = 7U;
            trim_value  = IFR1_VAL_240M_TRIM;
            break;
#endif
        default:
            freq_select = 0xFU;
            break;
    }

    if (0xFU == freq_select)
    {
        return kStatus_Fail;
    }

    /* Check if the trim value is valid */
    if (trim_value == 0xFFFFFFFFU)
    {
        return kStatus_Fail;
    }

